#!/usr/bin/python
#coding:gbk
'''
1. 密钥全部配置明文
2. 在交易的配置中所需的域都要配置，2、11、35、36、41、42、64有默认值，这些域才会自动赋值。
3. 关联域配置形如[-1, lambda x:x.req.fields['F011'].value]
-1是关联的交易的索引，标识取前面第一个交易，-2标识取前面第二个交易；
lambda表达式标识域内容，x标识交易本身，req，resp标识请求还是应答，fields['F011'].value取域的内容
'''

host = ('144.131.254.154', 30202)

term_id = '0007ZX01'
mchnt_id = '302440360120007'

card_no = '6227004403010031818'
pin = '123456'
track2 = '6225882116400091D0509567890123456'
track3 = '996225882116400091D1561560000000000000003976999236000002070000000000000000000000D000000000000D00'


qiandao = {
    'name' : '签到',
    'tpdu' : '6000000000',
    'msg_head' : '602200000000',
    'msg_type' :'0800',
    'F011' : '000001',
    'F041' : '11115005',
    'F042' : '123456789111115',
    'F060' : '00000001003',
    'F063' : '001'.encode('hex'),
}


daifu = {
    'name' : '代付',
    'tpdu' : '6000370000',
    'msg_head' : '603000000000',
    'msg_type' :'0200',
    'F002' : '6227004403010031818',
    'F003' : '290000',
    'F004' : '000000000001',
    'F011' : '505394',
    'F022' : '012',
    'F025' : '00',
    'F041' : '11115005',
    'F042' : '123456789111115',
    'F049' : '156',
    #'F057' : 'INS0820000013SSN32BCDS2017072509200089400000490781PSN17PRA17072516505394REM08银联代付ABI0200'.encode('hex'),
    'F060' : '22072516',
    'F062' : 'NM004赵刚'.encode('hex'),
    'F064' : '1234567890ABCDEF',
}



all_trans = [
    qiandao, 
    daifu,
]